---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseZProjection
source: html/d4d3b7a2-9999-7926-a227-443db4568930.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelBaseZProjection Property

"Base z Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelBaseZProjection { get; }
```